models/User.php

	public static function findIdentity( $id ) {
		return static::findOne( [ 'id' => $id ] );
---
SELECT * FROM `user` WHERE `id`=26

    public function updateOnline($time)
    {
        $this->last_login_time = $time;
        $this->save();
---
UPDATE `user` SET `update_time`=1739452534, `last_login_time`=1739452534 WHERE `id`=26